[
    {
        "title": "You can fake alignment. Not purpose",
        "text": "Nodding at plans that aren't yours is performance. Real purpose shows up uninvited—at 2 a.m., building something that finally makes sense to you, even if no one else gets it yet.",
        "link": "https://stakeholdertherapy.com/2025/04/07/2-a-m-dont-lie/",
        "linkText": "Read the post"
    },
    {
        "title": "Burnout isn't exhaustion. It's insignificance",
        "text": "Working hard doesn't break you. Working hard on things that don't matter does. The hours aren't the problem—it's the soul-crushing realization that none of it means anything.",
        "link": "https://stakeholdertherapy.com/2025/07/22/optimized-for-burnout/",
        "linkText": "Read the post"
    },
    {
        "title": "We optimize around breaking people",
        "text": "Hero culture sells a beautiful lie: if you really cared, you'd sacrifice everything. The people burning themselves out aren't heroes—they're casualties of a system designed to break them while calling it dedication.",
        "link": "https://stakeholdertherapy.com/2025/07/22/optimized-for-burnout/",
        "linkText": "Read the post"
    },
    {
        "title": "Respect is telling the truth",
        "text": "Somewhere along the way, we convinced ourselves that lying is kindness and honesty is aggressive. We call it professionalism while everything slowly rots around us.",
        "link": "https://stakeholdertherapy.com/2025/09/23/professional-courtesy/",
        "linkText": "Read the post"
    },
    {
        "title": "We traded judgment for formulas",
        "text": "Decision frameworks exist because deciding means you might be wrong, and being wrong means someone might blame you. Everyone knows the right answer before the process starts—we just need spreadsheets to agree with common sense.",
        "link": "https://stakeholdertherapy.com/2025/09/30/decision-laundering/",
        "linkText": "Read the post"
    },
    {
        "title": "You weren't hired to be a menu",
        "text": "Presenting three equally weighted options isn't expertise—it's cowardice with extra steps. Your job is to cut through the noise and recommend a path forward.",
        "link": "https://stakeholdertherapy.com/2024/07/24/dont-be-a-menu/",
        "linkText": "Read the post"
    },
    {
        "title": "Simple dies in committee",
        "text": "We've built careers around making easy things hard. One-line solutions get turned into roadmaps, quarterly planning cycles, and strategic initiatives. Most things don't need consensus—they need someone who gets them done.",
        "link": "https://stakeholdertherapy.com/2025/02/25/simple-dies-here/",
        "linkText": "Read the post"
    },
    {
        "title": "Safe spaces for words, hostile to thought",
        "text": "Organizations obsess over the language you use while crushing any real challenge to how things work. Question a fundamental assumption and watch yourself get buried in committees until your dissent dies from exhaustion.",
        "link": "https://stakeholdertherapy.com/2025/08/11/dissidents/",
        "linkText": "Read the post"
    },
    {
        "title": "The best idea dies from the wrong mouth",
        "text": "Organizations measure the diversity they can see while ignoring whether people feel safe to actually disagree. Sharp minds learn that survival means silence.",
        "link": "https://stakeholdertherapy.com/2025/08/11/dissidents/",
        "linkText": "Read the post"
    },
    {
        "title": "Distance doesn't make you strategic. It makes you numb",
        "text": "The further you are from consequences, the easier decisions become. Abstraction lets you optimize metrics without feeling the weight. But that weight doesn't disappear—it just lands on someone else who has to live with your choices.",
        "link": "https://stakeholdertherapy.com/2025/12/02/distance/",
        "linkText": "Read the post"
    },
    {
        "title": "Resistance proves you're onto something",
        "text": "People don't fight against what doesn't matter. When your words create waves, it's not because you're wrong—it's because you've touched something that threatens someone's comfort. Discomfort isn't a bug in truth-telling. It's a feature.",
        "link": "https://stakeholdertherapy.com/2025/03/26/resistance/",
        "linkText": "Read the post"
    },
    {
        "title": "Yesterday's cowboys become today's cops",
        "text": "The same people who cut corners and delivered half-assed work now police everyone else's standards. They lack self-awareness while everyone who's been around sees through it. Convenient amnesia makes for terrible gatekeepers.",
        "link": "https://stakeholdertherapy.com/2025/03/18/convenient-amnesia/",
        "linkText": "Read the post"
    },
    {
        "title": "Compliance is checkboxes. Quality is which ones you ignore",
        "text": "Following every rule perfectly produces mediocrity, not excellence. Mastery requires judgment—knowing when the process serves you and when it's just theater. Artists don't paint by numbers.",
        "link": "https://stakeholdertherapy.com/2025/02/04/painting-by-numbers/",
        "linkText": "Read the post"
    },
    {
        "title": "Detachment isn't strength. It's an excuse",
        "text": "Keeping work at arm's length feels professional, but it's just another way to avoid caring about whether what you build actually matters. Making a real difference requires making it personal, even when that's uncomfortable.",
        "link": "https://stakeholdertherapy.com/2024/06/30/make-it-personal/",
        "linkText": "Read the post"
    },
    {
        "title": "Being irreplaceable makes you a prisoner",
        "text": "We're taught to make ourselves essential to gain security, but specialization traps you in one context. True professional value comes from being replaceable and free, not indispensable and bound.",
        "link": "https://stakeholdertherapy.com/2025/01/23/focus-on-being-free/",
        "linkText": "Read the post"
    },
    {
        "title": "Perfection paralysis ships nothing",
        "text": "The more people you involve, the more feedback loops you add, the more mediocre the result becomes. Innovation isn't born from a desire to please everyone—it dies there.",
        "link": "https://stakeholdertherapy.com/2024/01/30/a-paradox-of-perfection/",
        "linkText": "Read the post"
    },
    {
        "title": "We're more afraid of loss than excited by gain",
        "text": "People cling to harmful situations because they fear change more than they desire improvement. That's how the status quo wins—not by being good, but by being familiar.",
        "link": "https://stakeholdertherapy.com/2023/06/01/the-status-quo-bias/",
        "linkText": "Read the post"
    },
    {
        "title": "Your time doesn't always need a purpose",
        "text": "Stop trying to optimize every moment. Real rest isn't scrolling through your phone—it's actual mental wandering, genuine silence, time that serves no measurable return. Guilt-free idleness isn't wasted time.",
        "link": "https://stakeholdertherapy.com/2025/01/28/do-nothing/",
        "linkText": "Read the post"
    },
    {
        "title": "We're not saving lives here",
        "text": "Technology work culture treats routine projects as life-or-death situations. This manufactured urgency creates unnecessary anxiety and drives burnout. Perspective matters—maintain it or lose yourself.",
        "link": "https://stakeholdertherapy.com/2022/09/20/were-not-saving-lives-here/",
        "linkText": "Read the post"
    },
    {
        "title": "De-risk everything, ship average shit",
        "text": "Every safety net you add, every approval gate, every process designed to prevent failure—they don't protect quality. They guarantee forgettable work that offends no one and inspires nothing.",
        "link": "https://stakeholdertherapy.com/2024/09/11/embrace-risk/",
        "linkText": "Read the post"
    },
    {
        "title": "That's not support. It's insurance fraud",
        "text": "You claim the premium of looking loyal in good times, then vanish when things get difficult. Real support means owning it together when things go sideways, not crafting a defensive paper trail to prove you warned everyone.",
        "link": "https://stakeholdertherapy.com/2025/06/16/emotional-insurance-fraud/",
        "linkText": "Read the post"
    },
    {
        "title": "Raising hands signals too many people in the room",
        "text": "When conversations require formal protocols, you've already lost. Real dialogue happens in small groups where people listen instead of rehearsing their next comment. Scaling up participation kills depth.",
        "link": "https://stakeholdertherapy.com/2025/01/07/raising-hands-is-dumb/",
        "linkText": "Read the post"
    },
    {
        "title": "Fix it. Don't announce it",
        "text": "If you find something broken, ask why instead of who, then fix it quietly. Real leadership is ego-free problem-solving, not broadcasting your contributions or finger-pointing. Call dibs, do the work, move on.",
        "link": "https://stakeholdertherapy.com/2024/08/26/call-dibs/",
        "linkText": "Read the post"
    },
    {
        "title": "Office hours are performance art",
        "text": "Blocking off limited time slots creates the illusion of accessibility while serving only your schedule. Your time belongs to your team. Be genuinely present and proactive or get out of the way.",
        "link": "https://stakeholdertherapy.com/2024/06/20/cut-the-office-hours-bullshit/",
        "linkText": "Read the post"
    }
]
